<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Support and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.Support</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Support</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>developer</key>
			<string>Root3 B.V.</string>
			<key>display_name</key>
			<string>Support</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>receipts</key>
			<array>
				<dict>
					<key>optional</key>
					<false/>
					<key>packageid</key>
					<string>nl.root4.support</string>
				</dict>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.Support</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
