<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of Jamf Connect.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.install.JamfConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Jamf Connect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.JamfConnect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
			<dict>
			    <key>pkg_path</key>
			    <string>%pathname%/JamfConnect.pkg</string>
			</dict>

		</dict>
	</array>
</dict>
</plist>
