<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Jamf Connect.</string>
		<key>Identifier</key>
		<string>com.github.opusmarketing.download.JamfConnect</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Jamf Connect</string>
			<key>DOWNLOAD_URL</key>
			<string>https://files.jamfconnect.com/JamfConnect.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>prefetch_filename</key>
					<true/>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: JAMF Software (483DWKW443)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/JamfConnectLogin.pkg</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>AppDmgVersioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%pathname%/JamfConnectLogin.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/JamfConnectLogin-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
		</array>
	</dict>
</plist>
