<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Jamf Connect and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.pkg.JamfConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Jamf Connect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.JamfConnect</string>
	<key>Process</key>
	<array>
	</array>
</dict>
</plist>
