<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Saber After Effects Plugin.</string>
	<key>Identifier</key>
	<string>local.install.SaberAEPlugin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Saber After Effects Plugin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>local.download.SaberAEPlugin</string>
	<key>Process</key>
	<array>
	</array>
</dict>
</plist>
