<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Saber After Effects Plugin.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.download.SaberAEPlugin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Saber After Effects Plugin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.videocopilot.net/dl/zu2TeXAuya/</string>
				<key>prefetch_filename</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.jazzace.processors/TextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>_([\d.]+)_</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>text_in</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
