<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Saber After Effects Plugin and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.pkg.SaberAEPlugin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Saber After Effects Plugin</string>
		<key>PKG_NAME</key>
		<string>Saber</string>
		<key>PKG_ID</key>
		<string>net.videocopilot.Saber</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.SaberAEPlugin</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/*.dmg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%found_filename%/*.app</string>
				<key>previous_file</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
            <key>Arguments</key>
			    <dict>
				    <key>source_path</key>
                    <string>%previous_file%/%found_basename%/Contents/Resources/Saber.plugin</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore/Public/Saber.plugin</string>
					<key>overwrite</key>
					<true/>
                </dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore/Public/Saber.plugin</string>
				<key>requirement</key>
				<string>identifier "net.videocopilot.Saber" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "462FK78NZ8"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>comment</key>
			<string>destination path for pkg is /Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore/Public with 755 for plugin and 775 for folders. </string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgname</key>
                    <string>%PKG_NAME%-%version%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                         <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
							<key>mode</key>
							<string>755</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Application Support/</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
							<key>mode</key>
							<string>755</string>
                        </dict>
						<dict>
                            <key>path</key>
                            <string>Library/Application Support/Adobe/</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
							<key>mode</key>
							<string>755</string>
                        </dict>
						<dict>
                            <key>path</key>
                            <string>Library/Application Support/Adobe/Common/Plug-ins/7.0/MediaCore/Public/Saber.plugin</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
							<key>mode</key>
							<string>755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
			<key>Processor</key>
            <string>PkgCreator</string>
        </dict>

 		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
		</dict>  
	</array>
</dict>
</plist>
