<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Ferdium.
	
Set SUPPORTED_ARCH to 'x86_64 and DOWNLOAD_ARCH to 'x64' for the Intel binary.
Set SUPPORTED_ARCH and DOWNLOAD_ARCH to 'arm64' for the Apple Silicon binary.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.download.Ferdium</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Ferdium</string>
		<key>DOWNLOAD_ARCH</key>
		<string>x64</string>
		<key>SUPPORTED_ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*\-%DOWNLOAD_ARCH%.dmg$</string>
				<key>github_repo</key>
				<string>ferdium/ferdium-app</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%DOWNLOAD_ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Ferdium.app</string>
				<key>requirement</key>
				<string>identifier "org.ferdium.ferdium-app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "55E9FPJ93P"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Ferdium.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
