<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Blender, packages it as universal binary and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.opusmarketing.munki.BlenderUniversal</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Blender</string>
        <key>NAMEWITHOUTSPACES</key>
		<string>Blender</string>
       	<key>MUNKI_CATEGORY</key>
		<string>Graphics &amp; Rendering</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>Blender is the open source, cross platform suite of tools for 3D creation.</string>
			<key>developer</key>
			<string>The Blender Foundation</string>
            <key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAMEWITHOUTSPACES%</string>
			<key>unattended_install</key>
			<true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.opusmarketing.pkg.BlenderUniversal</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                        <array>
                            <dict>
                                <key>CFBundleIdentifier</key>
                                <string>org.blenderfoundation.blender</string>
                                <key>CFBundleName</key>
                                <string>Blender</string>
                                <key>CFBundleVersion</key>
                                <string>%version%</string>
                                <key>minosversion</key>
                                <string>12.1.0</string>
                                <key>path</key>
                                <string>/Applications/Blender.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>version_comparison_key</key>
                                <string>CFBundleVersion</string>
                            </dict>
                        </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/%NAMEWITHOUTSPACES%-Universal-%version%.pkg</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
      </dict>
    </array>
</dict>
</plist>