<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest version of Call Manager and imports it into Munki. 

To select the architecture, use the following keys: 
- For Intel: SUPPORTED_ARCH = x86_64 and DOWNLOAD_ARCH = mac 
- For Apple Silicon: SUPPORTED_ARCH = arm64 and DOWNLOAD_ARCH = amcarm</string>
        <key>Identifier</key>
        <string>com.github.opusmarketing.munki.CallManager</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Call Manager</string>
            <key>NAMEWITHOUTSPACES</key>
            <string>CallManager</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Handle incoming calls when you`re connected to the net.</string>
                <key>developer</key>
                <string>Crown Software GmbH</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAMEWITHOUTSPACES%</string>
                <key>supported_architectures</key>
                <array>
                    <string>%SUPPORTED_ARCH%</string>
                </array>
                <key>unattended_install</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>2.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.opusmarketing.pkg.CallManager</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAMEWITHOUTSPACES%-%DOWNLOAD_ARCH%-%version%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>