<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest version of Call Manager. 
		
To select the architecture, use the	following keys:
- For Intel: SUPPORTED_ARCH = x86_64 and DOWNLOAD_ARCH = mac
- For Apple	Silicon: SUPPORTED_ARCH = arm64 and DOWNLOAD_ARCH = amcarm</string>
		<key>Identifier</key>
		<string>com.github.opusmarketing.download.CallManager</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Call Manager</string>
			<key>NAMEWITHOUTSPACES</key>
			<string>CallManager</string>
			<key>SUPPORTED_ARCH</key>
			<string>arm64</string>
			<key>DOWNLOAD_ARCH</key>
			<string>macarm</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://customer.hfo-cloud.de/frontend/application/%DOWNLOAD_ARCH%/CallManagerInstaller.dmg</string>
					<key>download_dir</key>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Call Manager.app</string>
					<key>requirement</key>
					<string>identifier "de.crown.ccs.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TT2E752Z5K</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Call Manager.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileMover</string>
				<key>Arguments</key>
				<dict>
					<key>source</key>
					<string>%pathname%</string>
					<key>target</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAMEWITHOUTSPACES%-%DOWNLOAD_ARCH%-%version%.dmg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>