<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest version of Call Manager and builds an installer package.</string>
		<key>Identifier</key>
		<string>com.github.opusmarketing.pkg.CallManager</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Call Manager</string>
			<key>NAMEWITHOUTSPACES</key>
			<string>CallManager</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.opusmarketing.download.CallManager</string>
	</dict>
</plist>