<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of WebM for Premiere.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.download.WebMPremiere</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WebM for Premiere</string>
        <key>DOWNLOAD_URL</key>
		<string>https://www.fnordware.com/downloads</string>
		<key>SEARCH_URL</key>
		<string>https://www.fnordware.com</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
			<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%SEARCH_URL%</string>
				<key>re_pattern</key>
				<string>(?P&lt;filename&gt;WebM_Premiere_v(?P&lt;version&gt;.*?).dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%/%filename%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/WebM Premiere.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Brendan Bolles (8SMU99Q8F3)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
