<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of WebM for Premiere and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.opusmarketing.munki.WebMPremiere</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
        <key>NAME</key>
        <string>WebM for Premiere</string>
        <key>NAMEWITHOUTSPACES</key>
		<string>WebMPremiere</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>WebM Open Movie Plugin for Premiere.</string>
			<key>developer</key>
			<string>fnord software</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAMEWITHOUTSPACES%</string>
			<key>unattended_install</key>
			<true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.opusmarketing.download.WebMPremiere</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pathname%</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
      </dict>
    </array>
</dict>
</plist>