<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of BigPicture and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.pkg.BigPicture2024</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>BigPicture 2024</string>
		<key>NAME</key>
		<string>BigPicture 2024</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.BigPicture2024</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/app/%NAME%.app</string>
			</dict>
		</dict>
		<dict>
		<key>Processor</key>
		<string>DmgCreator</string>
		<key>Arguments</key>
		<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/app/</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>PathDeleter</string>
		<key>Arguments</key>
		<dict>
			<key>path_list</key>
			<array>
				<string>%RECIPE_CACHE_DIR%/app/</string>
			</array>
		</dict>
	</dict>
	</array>
</dict>
</plist>
