<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the After Effects Moodboard Animation Script.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.pkg.AEMoodBoardAnimationScript</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>After Effects Moodboard Animation Script</string>
		<key>PKG_NAME</key>
		<string>AEMoodBoardAnimationScript</string>
		<key>PKG_ID</key>
		<string>com.opusmarketing.AfterEffectsMoodBoardAnimationScript</string>
        <key>CC_VERSION</key>
        <string>2023</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.AEMoodBoardAnimationScript</string>
	<key>Process</key>
	<array>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/Adobe After Effects %CC_VERSION%/Scripts/ScriptUI Panels/</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>

<!-- 		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
                    <key>Applications/Adobe After Effects %CC_VERSION%/Scripts/ScriptUI Panels</key>
                    <string>755</string> 
                </dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>  -->

	 	<dict>
			<key>comment</key>
			<string>destination path for pkg is /Applications/Adobe After Effects %CC_VERSION%/Scripts/ScriptUI Panels with 755 for plugin and 775 for folders. </string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgname</key>
                    <string>%PKG_NAME%-%version%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                         <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
							<key>mode</key>
							<string>775</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Applications/Adobe After Effects %CC_VERSION%/</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
							<key>mode</key>
							<string>775</string>
                        </dict>
						<dict>
                            <key>path</key>
                            <string>Applications/Adobe After Effects %CC_VERSION%/Scripts</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
							<key>mode</key>
							<string>755</string>
                        </dict>
						<dict>
                            <key>path</key>
                            <string>Applications/Adobe After Effects %CC_VERSION%/Scripts/ScriptUI Panels</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
							<key>mode</key>
							<string>755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
			<key>Processor</key>
            <string>PkgCreator</string>
        </dict>

 		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
            <key>Processor</key>
			<string>PathDeleter</string>
		</dict>

	</array>
</dict>
</plist>
