<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of SkyFonts and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.SkyFonts</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>SkyFonts</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>category</key>
			<string></string>
			<key>description</key>
			<string>The simplest way to try, install, and manage fonts. Install fonts from participating sites with a single click. Fonts are installed from the cloud on your computer in seconds.</string>
			<key>developer</key>
			<string>Monotype Imaging Inc.</string>
			<key>display_name</key>
			<string>SkyFonts</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.SkyFonts</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
		<key>Arguments</key>
		<dict>
			<key>source_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/Install SkyFonts.app/Contents/Resources/%NAME%.app</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
			<key>overwrite</key>
			<true/>
		</dict>
		<key>Processor</key>
		<string>Copier</string>
	</dict>
	<dict>
	<key>Arguments</key>
	<dict>
		<key>path_list</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%/Install SkyFonts.app</string>
	</dict>
	<key>Processor</key>
	<string>PathDeleter</string>
</dict>
<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
