<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OpenColorIO Configs and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.OpenColorIOConfigs</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>OpenColorIO Configs</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>description</key>
			<string>Configs for OpenColorIO which is an open source system for managing color in film production pipelines.</string>
			<key>developer</key>
			<string>OpenColorIO</string>
			<key>display_name</key>
			<string>OpenColorIO Configs</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.pkg.OpenColorIOConfigs</string>
	<key>Process</key>
	<array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/%PKG_NAME%-%version%.pkg</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
      </dict>
	</array>
</dict>
</plist>
