<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of PDFsam Basic. 
		
To select the architecture, use the following keys: 
- For Intel: SUPPORTED_ARCH = x86_64 and DOWNLOAD_ARCH = x64 
- For Apple	Silicon: SUPPORTED_ARCH = arm64 and DOWNLOAD_ARCH = arm64</string>
		<key>Identifier</key>
		<string>com.github.opusmarketing.download.PDFsamBasic</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>PDFsam Basic</string>
			<key>SUPPORTED_ARCH</key>
			<string>arm64</string>
			<key>DOWNLOAD_ARCH</key>
			<string>arm64</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>.*%DOWNLOAD_ARCH%*\.dmg$</string>
					<key>github_repo</key>
					<string>torakiki/pdfsam</string>
				</dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%DOWNLOAD_ARCH%-%version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/PDFsam Basic.app</string>
					<key>requirement</key>
					<string>identifier "org.pdfsam.basic" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8XM3GHX436"</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/PDFsam Basic.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>