<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of PDFsam Basic and imports it into Munki.

To select the architecture, use the following keys: 
- For Intel: SUPPORTED_ARCH = x86_64 and DOWNLOAD_ARCH = x64 
- For Apple Silicon: SUPPORTED_ARCH = arm64 and DOWNLOAD_ARCH = arm64</string>
		<key>Identifier</key>
		<string>com.github.opusmarketing.munki.PDFsamBasic</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>PDFsam Basic</string>
			<key>SUPPORTED_ARCH</key>
			<string>arm64</string>
			<key>DOWNLOAD_ARCH</key>
			<string>arm64</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>PDFsam, a desktop application to split, merge, mix, rotate PDF files and extract pages</string>
				<key>developer</key>
				<string>Andrea Vacondio</string>
				<key>display_name</key>
				<string>PDFsam Basic</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>supported_architectures</key>
				<array>
					<string>%SUPPORTED_ARCH%</string>
				</array>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.opusmarketing.download.PDFsamBasic</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>