<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of the Barco ClickShare app (PKG version).</string>
        <key>Identifier</key>
        <string>com.opusmarketing.download.ClickSharePkg</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ClickShare</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>"downloadUrl":"(https://securefiles.barco.com/tde/Active/SoftwareFiles/ApplicationSoftware/(?P&lt;filename&gt;[^/"]+?\.zip)[^"]*)"</string>
                    <key>result_output_var_name</key>
                    <string>match</string>
                    <key>curl_opts</key>
                    <array>
                        <string>--cookie-jar</string>
                        <string>%RECIPE_CACHE_DIR%/cookies.txt</string>
                        <string>--cookie</string>
                        <string>%RECIPE_CACHE_DIR%/cookies.txt</string>
                        <string>--header</string>
                        <string>'Accept-Encoding: gzip, deflate</string>
                    </array>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                        <key>Accept</key>
                        <string>text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</string>
                        <key>Sec-Fetch-Site</key>
                        <string>none</string>
                        <key>Sec-Fetch-Dest</key>
                        <string>document</string>
                        <key>Accept-Language</key>
                        <string>en-GB,en;q=0.9</string>
                        <key>Priority</key>
                        <string>u=0, i</string>
                        <key>Accept-Encoding</key>
                        <string>gzip, deflate, br</string>
                        <key>Sec-Fetch-Mode</key>
                        <string>navigate</string>
                    </dict>
                    <key>url</key>
                    <string>https://www.barco.com/bin/barco/tde/downloadUrl.json?fileNumber=R3307118&amp;tdeType=3</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%filename%</string>
                    <key>url</key>
                    <string>%match%</string>
                    <key>curl_opts</key>
                    <array>
                        <string>--cookie</string>
                        <string>%RECIPE_CACHE_DIR%/cookies.txt</string>
                    </array>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.4.1 Safari/605.1.15</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>


            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>

            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                </dict>
                <key>Processor</key>
                <string>Unarchiver</string>
            </dict>

            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked/*.pkg</string>
                </dict>
                <key>Processor</key>
                <string>FileFinder</string>
            </dict>

            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Barco NV (P6CDJZR997)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%found_filename%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>

            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%found_filename%</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/%found_basename%</string>
                </dict>
                <key>Processor</key>
                <string>FileMover</string>
            </dict>

            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>

        </array>
    </dict>
</plist>