<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of EPOS Connect.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.download.EPOSConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>EPOS Connect</string>
		<key>SEARCH_URL</key>
		<string>https://www.eposaudio.com/de/de/enterprise/software/epos-connect</string>
		<key>SEARCH_PATTERN</key>
        <string>(?P&lt;DOWNLOAD_URL&gt;https://www.eposaudio.com/globalassets/_enterprise_media/software/epos-connect/mac/eposconnect_(?P&lt;version&gt;.*?).pkg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: EPOS GROUP AS (8956A7Y69J)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
