<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of EPOS Connect and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.opusmarketing.munki.EPOSConnect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EPOS Connect</string>
        <key>NAMEWITHOUTSPACES</key>
		<string>EPOSConnect</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>Update with the latest firmware and personalize your EPOS audio device settings to ensure flawless operation and maximum productivity.</string>
			<key>developer</key>
			<string>EPOS</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAMEWITHOUTSPACES%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.opusmarketing.download.EPOSConnect</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pathname%</string>
          </dict>
      </dict>
    </array>
</dict>
</plist>