<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Adobe Uninstaller and imports it into Munki.
	Based on the recipe from https://github.com/autopkg/jazzace-recipes/tree/master/AdobeUninstaller</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.AdobeUninstaller</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Adobe Uninstaller</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>description</key>
			<string>Command line tool to uninstall Adobe Apps.</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Uninstaller</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.pkg.AdobeUninstaller</string>
	<key>Process</key>
	<array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pkg_path%</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
      </dict>
	</array>
</dict>
</plist>
