<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Screaming Frog SEO and builds an installer package which installs the correct version for your Mac's processor.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.pkg.ScreamingFrogSEO</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Screaming Frog SEO Spider</string>
		<key>NAMEWITHOUTSPACES</key>
		<string>ScreamingFrogSEO</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.ScreamingFrogSEO</string>
</dict>
</plist>