<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Screaming Frog SEO and imports it into Munki.

	For the Apple Silicon version, set DOWNLOAD_ARCH to aarch64 and SUPPORTED_ARCH to arm64
	For the Intel version, set both DOWNLOAD_ARCH and SUPPORTED_ARCH to x86_64
	</string>
    <key>Identifier</key>
    <string>com.github.opusmarketing.munki.ScreamingFrogSEO</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Screaming Frog SEO</string>
        <key>NAMEWITHOUTSPACES</key>
		<string>ScreamingFrogSEO</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>developer</key>
            <string>Screaming Frog Ltd</string>
            <key>description</key>
            <string>The Screaming Frog SEO Spider is a small desktop program you can install locally on your PC, Mac or Linux machine which spiders websites’ links, images, CSS, script and apps from an SEO perspective. It fetches key onsite elements for SEO, presents them in tabs by type and allows you to filter for common SEO issues, or slice and dice the data how you see fit by exporting into Excel. You can view, analyse and filter the crawl data as it’s gathered and updated continuously in the program’s user interface.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAMEWITHOUTSPACES%</string>
            <key>supported_architectures</key>
            <array>
                <string>%SUPPORTED_ARCH%</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.opusmarketing.pkg.ScreamingFrogSEO</string>
    <key>Process</key>
    <array>
      <dict>
          <key>Processor</key>
          <string>MunkiImporter</string>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%pathname%</string>
              <key>repo_subdirectory</key>
              <string>%MUNKI_REPO_SUBDIR%</string>
          </dict>
      </dict>
    </array>
</dict>
</plist>