<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of OpenColorIO for After Effects.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.download.OpenColorIOAE</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenColorIO for After Effects</string>
		<key>SEARCH_URL</key>
		<string>http://www.fnordware.com/OpenColorIO/</string>
        <key>REDIRECT_PATTERN</key>
        <string>(HTTP-EQUIV="REFRESH" CONTENT="0; URL=(?P&lt;REDIRECT_URL&gt;.*?)")</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;http://www.fnordware.com/OpenColorIO/OpenColorIO_AE_v(?P&lt;version&gt;.*?)_mac.dmg)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%REDIRECT_PATTERN%</string>
				<key>url</key>
				<string>%SEARCH_URL%</string>
                <key>curl_opts</key>
                <array>
                    <string>-L</string>
                </array>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>url</key>
				<string>%REDIRECT_URL%</string>
                <key>curl_opts</key>
                <array>
                    <string>-L</string>
                </array>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>download_dir</key>
				<string>%RECIPE_CACHE_DIR%/downloads/</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%pathname%/*.plugin</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
 		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%found_basename%</string>
				<key>requirement</key>
				<string>identifier "org.OpenColorIO.AfterEffects" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8SMU99Q8F3"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict> 
	</array>
</dict>
</plist>
