<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Monotype App and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.MonotypeApp</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Monotype App</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>description</key>
			<string>Sync fonts using the Monotype App.</string>
			<key>developer</key>
			<string>Monotype Imaging Inc.</string>
			<key>display_name</key>
			<string>Monotype App</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.pkg.MonotypeApp</string>
	<key>Process</key>
	<array>

    	<dict>
        	<key>Arguments</key>
        	<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>preuninstall_script</key>
					<string>#!/bin/bash
OIFS="$IFS"
IFS=$'\n'
for indesign in $(cd /Applications &amp;&amp; ls -d1 *InDesign*); do
	if ls -d1 "/Applications/$indesign/"*.app &gt; /dev/null 2&gt; /dev/null;
	then
		echo $indesign "is present."
		indesignversion=$(defaults read "/Applications/$indesign/$indesign.app/Contents/Info.plist" CFBundleShortVersionString | awk -F. '{print $1}')
		echo "InDesign version number:" $indesignversion
		for pluginversion in $(cd "/Applications/Monotype desktop app/.addons/adobe_indesign" &amp;&amp; ls -1); do
			if [ $pluginversion == $indesignversion ]; then
				if [ -d "/Applications/$indesign/Plug-Ins/"*Monotype*.InDesignPlugin ]; then
					echo "Deleting InDesign Plugin..."
					sudo rm -rf "/Applications/$indesign/Plug-Ins/"*Monotype*.InDesignPlugin
				fi
			fi
		done
		echo "Installation of InDesign Plugin(s) complete."
	else
		echo "$indesign is orphaned."
	fi
done
IFS="$OIFS"
</string>
					<key>postuninstall_script</key>
					<string>#!/bin/bash
set -x

file="/Applications/Monotype desktop app/uninstall.app"
if [ -e "$file" ]
then
	echo "$file found."
    cd "/Applications/Monotype desktop app/uninstall.app/Contents/MacOS/"
    sudo ./installbuilder.sh --mode unattended --unattendedmodeui none
else
	echo "$file not found."
fi
</string>
					<key>preinstall_script</key>
					<string>#!/bin/bash
OIFS="$IFS"
IFS=$'\n'
for indesign in $(cd /Applications &amp;&amp; ls -d1 *InDesign*); do
	if ls -d1 "/Applications/$indesign/"*.app &gt; /dev/null 2&gt; /dev/null;
	then
		echo $indesign "is present."
		indesignversion=$(defaults read "/Applications/$indesign/$indesign.app/Contents/Info.plist" CFBundleShortVersionString | awk -F. '{print $1}')
		echo "InDesign version number:" $indesignversion
		for pluginversion in $(cd "/Applications/Monotype desktop app/.addons/adobe_indesign" &amp;&amp; ls -1); do
			if [ $pluginversion == $indesignversion ]; then
				if [ -d "/Applications/$indesign/Plug-Ins/"*Monotype*.InDesignPlugin ]; then
					echo "Deleting InDesign Plugin..."
					sudo rm -rf "/Applications/$indesign/Plug-Ins/"*Monotype*.InDesignPlugin
				fi
			fi
		done
		echo "Installation of InDesign Plugin(s) complete."
	else
		echo "$indesign is orphaned."
	fi
done
IFS="$OIFS"
</string>
					<key>postinstall_script</key>
					<string>#!/bin/bash
#set -x
OIFS="$IFS"
IFS=$'\n'
if [ ! -d "/Applications/Monotype desktop app/.addons/adobe_indesign" ]; then
	echo "Monotype Fonts InDesign Plugin directory not present. Quitting!"
	exit 1
fi
for indesign in $(cd /Applications &amp;&amp; ls -d1 *InDesign*); do
	if ls -d1 "/Applications/$indesign/"*.app &gt; /dev/null 2&gt; /dev/null;
	then
		echo $indesign "is present."
		indesignversion=$(defaults read "/Applications/$indesign/$indesign.app/Contents/Info.plist" CFBundleShortVersionString | awk -F. '{print $1}')
		echo "InDesign version number:" $indesignversion
		for pluginversion in $(cd "/Applications/Monotype desktop app/.addons/adobe_indesign" &amp;&amp; ls -1); do
			if [ $pluginversion == $indesignversion ]; then
				if [ -d "/Applications/$indesign/Plug-Ins/"*Monotype*.InDesignPlugin ]; then
					echo "Deleting old InDesign Plugin..."
					sudo rm -rf "/Applications/$indesign/Plug-Ins/"*Monotype*.InDesignPlugin
				fi
				echo "Copying InDesign Plugin version $pluginversion to $indesign..."
				unzip -KXoq "/Applications/Monotype desktop app/.addons/adobe_indesign/$pluginversion/*.zip" -d /tmp/
				for pluginfile in $(cd /tmp/ &amp;&amp; ls -d1 *.InDesignPlugin); do
					sudo mv -f /tmp/$pluginfile /Applications/$indesign/Plug-Ins/
					sudo chown -R root:admin /Applications/$indesign/Plug-Ins/$pluginfile
					sudo chmod 755 /Applications/$indesign/Plug-Ins/$pluginfile
				done
			fi
		done
		echo "Installation of InDesign Plugin(s) complete."
	else
		echo "$indesign is orphaned."
	fi
done
IFS="$OIFS"
</string>
				</dict>
			</dict>
			<key>Processor</key>
        	<string>MunkiPkginfoMerger</string>
    	</dict>

    	<dict>
        	<key>Arguments</key>
        	<dict>
            	<key>pkg_path</key>
            	<string>%RECIPE_CACHE_DIR%/%NAMEWITHOUTSPACES%-%version%.pkg</string>
            	<key>repo_subdirectory</key>
            	<string>%MUNKI_REPO_SUBDIR%</string>
          	</dict>
			<key>Processor</key>
        	<string>MunkiImporter</string>
      </dict>

	</array>
</dict>
</plist>


