<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Monotype App and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.MonotypeApp</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Monotype App</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>description</key>
			<string>Sync fonts using the Monotype App.</string>
			<key>developer</key>
			<string>Monotype Imaging Inc.</string>
			<key>display_name</key>
			<string>Monotype App</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.pkg.MonotypeApp</string>
	<key>Process</key>
	<array>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/DTAppInstaller.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>

		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/pkg/payload-unpacked/</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>

		<dict>
        	<key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/pkg/payload-unpacked/app.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/pkg/payload-unpacked/app/</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
    	</dict>

     	<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/pkg/payload-unpacked/app/DTAppInstaller.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>

		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpacked/pkg</string>
				</array>
			</dict>
		</dict>

    	<dict>
        	<key>Arguments</key>
        	<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
        	<string>MunkiPkginfoMerger</string>
      </dict>

    	<dict>
        	<key>Arguments</key>
        	<dict>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Monotype desktop app/Monotype desktop app.app</string>
				</array>
				<key>version_comparison_key</key>
				
			</dict>
			<key>Processor</key>
        	<string>MunkiInstallsItemsCreator</string>
      </dict>

    	<dict>
        	<key>Arguments</key>
        	<dict>
            	<key>pkg_path</key>
            	<string>%RECIPE_CACHE_DIR%/unpacked/DTAppInstaller.pkg</string>
            	<key>repo_subdirectory</key>
            	<string>%MUNKI_REPO_SUBDIR%</string>
          	</dict>
			<key>Processor</key>
        	<string>MunkiImporter</string>
      </dict>

	</array>
</dict>
</plist>
