<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest version of the Monotype App and builds an installer package which
			installs the correct version for your Mac's processor.</string>
		<key>Identifier</key>
		<string>com.github.opusmarketing.pkg.MonotypeApp</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Monotype App</string>
			<key>NAMEWITHOUTSPACES</key>
			<string>MonotypeApp</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.opusmarketing.download.MonotypeApp</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/unpacked/*.pkg</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
		</array>
	</dict>
</plist>