<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Monotype App and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.MonotypeApp</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Monotype App</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>default</string>
			</array>
			<key>description</key>
			<string>Sync fonts using the Monotype App.</string>
			<key>developer</key>
			<string>Monotype Imaging Inc.</string>
			<key>display_name</key>
			<string>Monotype App</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.pkg.MonotypeApp</string>
	<key>Process</key>
	<array>

    	<dict>
        	<key>Arguments</key>
        	<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>postuninstall_script</key>
					<string>#!/bin/sh
set -x

#installername=$(ls "/Applications/Monotype desktop app/uninstall.app/Contents/MacOS/" | grep -v -e #installbuilder.sh -e uninstall)
#macarm=osx-arm64
#intel=osx-x86_64
#processor=$(/usr/sbin/sysctl -n machdep.cpu.brand_string | grep -o "Intel")
#if [[ -n "$processor" ]]; then
#sudo "/Applications/Monotype desktop app/uninstall.app/Contents/MacOS/"$intel --mode unattended
#else
#sudo "/Applications/Monotype desktop app/uninstall.app/Contents/MacOS/"$macarm --mode unattended
#fi
sudo pkill "Monotype desktop app"
sudo "/Applications/Monotype desktop app/uninstall.app/Contents/MacOS/installbuilder.sh"
pkgutil --unlink com.monotype.mtf.app.desktop.silent
pkgutil --forget com.monotype.mtf.app.desktop.silent
</string>
				</dict>
			</dict>
			<key>Processor</key>
        	<string>MunkiPkginfoMerger</string>
    	</dict>

    	<dict>
        	<key>Arguments</key>
        	<dict>
            	<key>pkg_path</key>
            	<string>%pkg_path%</string>
            	<key>repo_subdirectory</key>
            	<string>%MUNKI_REPO_SUBDIR%</string>
          	</dict>
			<key>Processor</key>
        	<string>MunkiImporter</string>
      </dict>

	</array>
</dict>
</plist>


