<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tabby and imports it into Munki.	
	
	Change SUPPORTED_ARCH to x86_64 for Intel version, default is arm64 for Apple Silicon version.</string>
	<key>Identifier</key>
	<string>com.github.opusmarketing.munki.Tabby</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Tabby</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>A terminal for a more modern age</string>
			<key>developer</key>
			<string>Syslink GmbH</string>
			<key>display_name</key>
			<string>Tabby</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
            <array>
                <string>%SUPPORTED_ARCH%</string>
            </array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.opusmarketing.download.Tabby</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
